toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
SDStatusResp System::_sd_sendCmd(
    uint8_t sdCmd,
    uint32_t sdArg,
    SDSendCmdMsg::RespType respType,
    SDSendCmdMsg::DatInType datInType
) {
    _ice_transfer(SDSendCmdMsg(sdCmd, sdArg, respType, datInType));
    
    // Wait for command to be sent
    const uint16_t MaxAttempts = 1000;
    for (uint16_t i=0; i<MaxAttempts; i++) {
        if (i >= 10) HAL_Delay(1);
        auto status = _sd_status();
        // Try again if the command hasn't been sent yet
        if (!status.cmdDone()) continue;
        // Try again if we expect a response but it hasn't been received yet
        if ((respType==SDRespType::Len48||respType==SDRespType::Len136) && !status.respDone()) continue;
        // Try again if we expect DatIn but it hasn't been received yet
        if (datInType==SDDatInType::Len512x1 && !status.datInDone()) continue;
        return status;
    }
    // Timeout sending SD command
    abort();
}

void System::_sd_readTask() {
    static bool init = false;
    static bool reading = false;
    static uint16_t rca = 0;
    const auto& arg = _cmd.arg.SDRead;
    
    TaskBegin();
    
    // Accept command
    _usb.cmdAccept(true);
    
    // Initialize the SD card if we haven't done so
    if (!init) {
        rca = _sd_init();
        init = true;
    }
    
    // Stop reading from the SD card if a read is in progress
    if (reading) {
        _ICE_ST_SPI_CS_::Write(1);
        
        // ====================
        // CMD12 | STOP_TRANSMISSION
        //   State: Send Data -> Transfer
        //   Finish reading
        // ====================
        {
            auto status = _sd_sendCmd(SDSendCmdMsg::CMD12, 0);
            Assert(!status.respCRCErr());
        }
        
        reading = false;
    }
    
    // Reset DataIn endpoint (which sends a 2xZLP+sentinel sequence)
    _usb.reset(Endpoints::DataIn);
    // Wait until we're done resetting the DataIn endpoint
    TaskWait(_usb.ready(Endpoints::DataIn));
    
    // Update state
    reading = true;
    
    // ====================
    // CMD18 | READ_MULTIPLE_BLOCK
    //   State: Transfer -> Send Data
    //   Read blocks of data (1 block == 512 bytes)
    // ====================
    {
        auto status = _sd_sendCmd(SDSendCmdMsg::CMD18, arg.addr, SDRespType::Len48, SDDatInType::Len4096xN);
        Assert(!status.respCRCErr());
    }
    
    // Start the Readout task
    _readoutTask.reset();
}

#pragma mark - Img

void System::_img_setPowerEnabled(bool en) {
    constexpr uint16_t BIT0             = 1<<0;
    constexpr uint16_t BIT2             = 1<<2;
    constexpr uint16_t VDD_1V9_IMG_EN   = BIT0;
    constexpr uint16_t VDD_2V8_IMG_EN   = BIT2;
    constexpr uint16_t PADIRAddr       = 0x0204;
    constexpr uint16_t PAOUTAddr       = 0x0202;
    
    const uint16_t PADIR = _msp.read(PADIRAddr);
    const uint16_t PAOUT = _msp.read(PAOUTAddr);
    _msp.write(PADIRAddr, PADIR | (VDD_2V8_IMG_EN | VDD_1V9_IMG_EN));
    
    if (en) {
        _msp.write(PAOUTAddr, PAOUT | (VDD_2V8_IMG_EN));
        HAL_Delay(1); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V9)
        _msp.write(PAOUTAddr, PAOUT | (VDD_2V8_IMG_EN|VDD_1V9_IMG_EN));
    
    } else {
        // No delay between 2V8/1V9 needed for power down (per AR0330CS datasheet)
        _msp.write(PAOUTAddr, PAOUT & ~(VDD_2V8_IMG_EN|VDD_1V9_IMG_EN));
    }
    
    #warning TODO: measure how long it takes for IMG rails to rise
    // The TPS22919 takes 1ms for VDD_2V8_IMG VDD to reach 2.8V (empirically measured)
    HAL_Delay(2);
}

void System::_img_init() {
    _img_setPowerEnabled(true);
    
    _ice_transfer(ImgResetMsg(0));
    HAL_Delay(1);
    _ice_transfer(ImgResetMsg(1));
    // Wait 150k EXTCLK (16MHz) periods
    // (150e3*(1/16e6)) == 9.375ms
    HAL_Delay(10);
}

ImgI2CStatusResp System::_imgI2CStatus() {
    ImgI2CStatusResp resp;
    _ice_transfer(ImgI2CStatusMsg(), resp);
    return resp;
}

ImgCaptureStatusResp System::_imgCaptureStatus() {
    ImgCaptureStatusResp resp;
    _ice_transfer(ImgCaptureStatusMsg(), resp);
    return resp;
}

ImgI2CStatusResp System::_imgI2C(bool write, uint16_t addr, uint16_t val) {
    _ice_transfer(ImgI2CTransactionMsg(write, 2, addr, 0));
    
    // Wait for the I2C transaction to complete
    const uint32_t MaxAttempts = 1000;
    for (uint32_t i=0; i<MaxAttempts; i++) {
        if (i >= 10) HAL_Delay(1);
        const ImgI2CStatusResp status = _imgI2CStatus();
        if (status.err() || status.done()) return status;
    }
    // Timeout getting response from ICE40
    // This should never happen, since it indicates a Verilog error or a hardware failure.
    abort();
}

ImgI2CStatusResp System::_imgI2CRead(uint16_t addr) {
    return _imgI2C(false, addr, 0);
}

ImgI2CStatusResp System::_imgI2CWrite(uint16_t addr, uint16_t val) {
    return _imgI2C(true, addr, val);
}

void System::_img_i2cTask() {
    static bool init = false;
    static ImgI2CStatus status = {};
    const auto& arg = _cmd.arg.ImgI2C;
    
    TaskBegin();
    _usb.cmdAccept(true);
    
    // Initialize image sensor if we haven't done so already
    if (!init) {
        _img_init();
        init = true;
    }
    
    {
        const ImgI2CStatusResp s = _imgI2C(arg.write, arg.addr, arg.val);
        status.ok = !s.err();
        status.readData = s.readData();
    }
    
    {
        _usb.send(Endpoints::DataIn, &status, sizeof(status));
        TaskWait(_usb.ready(Endpoints::DataIn));
    }
}

void System::_img_captureTask() {
    static ImgCaptureStatus status = {};
    TaskBegin();
    _usb.cmdAccept(true);
    
    _ice_transfer(ImgCaptureMsg(0));
    
    // Wait a max of `MaxDelayMs` for the the capture to be ready for readout
    constexpr uint32_t MaxDelayMs = 1000;
    const uint32_t startTime = HAL_GetTick();
    ImgCaptureStatusResp s;
    for (;;) {
        s = _imgCaptureStatus();
        if (s.done() || (HAL_GetTick()-startTime)>=MaxDelayMs) break;
    }
    
    status.ok               = s.done();
    status.wordCount        = s.wordCount();
    status.highlightCount   = s.highlightCount();
    status.shadowCount      = s.shadowCount();
    
    _usb.send(Endpoints::DataIn, &status, sizeof(status));
    TaskWait(_usb.ready(Endpoints::DataIn));
    
    // Bail if the capture failed
    if (!status.ok) return;
    
    // Start the Readout task
    _readoutTask.reset();
}

#pragma mark - Other Commands

void System::_ledSet() {
    switch (_cmd.arg.LEDSet.idx) {
    case 0: _usb.cmdAccept(false); return;
    case 1: _LED1::Write(_cmd.arg.LEDSet.on); break;
    case 2: _LED2::Write(_cmd.arg.LEDSet.on); break;
    case 3: _LED3::Write(_cmd.arg.LEDSet.on); break;
    }
    
    _usb.cmdAccept(true);
}

System Sys;

bool IRQState::SetInterruptsEnabled(bool en) {
    const bool prevEn = !__get_PRIMASK();
    if (en) __enable_irq();
    else __disable_irq();
    return prevEn;
}

void IRQState::WaitForInterrupt() {
    __WFI();
}

int main() {
    Sys.init();
    Sys.run();
    return 0;
}

[[noreturn]] void abort() {
    Sys.abort();
}
